# _**Итоги блока. Выбор специализации. Контрольная работа**_

## **Задача**

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## **Описание решения задачи**

Создаём имеющийся массив строк array:

        string[] array = { "Hey", "you", "out", "there", "in", "the", "cold", "getting", "lonely", "getting", "old" };

Затем создаём новый массив result, в который будем помещать строки, удовлетворяющие условию задачи, т.е. длина которых меньше или равна 3 символам:

        string[] result = new string[array.Length];

Затем проверяем условие (количество символов в строке меньше или равно 3):

        if (array[i].Length <= 3) result[i] = array[i];

При выполнении этого условия записываем строку в массив result.

Если условие не выполняется, то в массив result записываем пустую строку:

        else result[i] = string.Empty;

Затем проверяем, если строка не пустая, то выводим её на экран:

        if (result[i] != string.Empty) Console.Write($"[{result[i]}] ");

В итоге получаем вывод на экране:

        [Hey] [you] [out] [in] [the] [old]